config.org
#+begin_src emacs-lisp :tangle yes
;; -*- lexical-binding: t -*-
#+end_src

* Who am I?
#+begin_src emacs-lisp :tangle yes
;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Francis Chan"
      user-mail-address "jackychany321@gmail.com")
#+end_src

* Font
#+begin_src emacs-lisp :tangle yes
;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))
(setq doom-font (font-spec :family "Sarasa Fixed HC" :size 12 :weight 'light)
      doom-variable-pitch-font (font-spec :family "Sarasa Fixed HC" :size 13 :weight 'light)
      doom-big-font nil
      )
#+end_src

* Theme
#+begin_src emacs-lisp :tangle yes
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-nord)
#+end_src

* Org directory
#+begin_src emacs-lisp :tangle yes
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")
#+end_src

* Misc effects
#+begin_src emacs-lisp :tangle yes
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)

;; Delete duplicated history
(setq history-delete-duplicates t)

;; fullscreen on startup
(add-to-list 'initial-frame-alist '(fullscreen . maximized))

;; tranparency NOTE It makes the text transparent too
(set-frame-parameter (selected-frame) 'alpha '(100 85))
;; (add-to-list 'default-frame-alist '(alpha 100 10))

(setq tab-width 4)

(setq! enable-local-variables t)

(setq! scroll-lock-mode t)
#+end_src

* Org scratch buffer
#+begin_src emacs-lisp :tangle yes
;; scratch buffer default `org-mode'
(setq! doom-scratch-initial-major-mode 'org-mode)
#+end_src

* Vterm use fish
#+begin_src emacs-lisp :tangle yes
(after! vterm (setq! vterm-shell "~/.nix-profile/bin/fish"))
#+end_src

* Auto format modes
#+begin_src emacs-lisp :tangle yes
(setq! +format-on-save-enabled-modes '(haskell-mode nix-mode))
#+end_src

* Org babel
** Typescript
- ref :: https://www.reddit.com/r/emacs/comments/b7rsxu/behold_orgbabelexecutetypescript/
#+begin_src emacs-lisp :tangle yes
(defun org-babel-execute:typescript (body params)
  "babel execute typescript"
  (let* ((tmp-ts-file (org-babel-temp-file "scripts" ".ts"))
         (tmp-js-file (concat (substring tmp-ts-file 0 -2) "js"))
         (strict (if (assq :strict params) "--strict " ""))
         (cmd (concat "tsc " strict (shell-quote-argument tmp-ts-file))))
    (with-temp-file tmp-ts-file (insert body))
    (with-temp-buffer
      (if (eq (call-process-shell-command cmd nil t) 0)
          (progn
            (insert-file-contents tmp-js-file)
            (if (assq :js params)
                (buffer-string)
              (require 'ob-js)
              (org-babel-execute:js (buffer-string) params)))
        (buffer-string)))))

;; NOTE when async
;; executing Typescript code block...
;; error in process sentinel: async-handle-result: Cannot open load file: No such file or directory, ob-typescript
;; maybe related? https://github.com/hlissner/doom-emacs/issues/2198
;; TEMP FIXME
(setq ob-async-no-async-languages-alist '("typescript"))
#+end_src

** Org special edit's lsp support
#+begin_src emacs-lisp :tangle yes
;; NOTE: https://github.com/emacs-lsp/lsp-mode/issues/2842#issuecomment-870807018
(defmacro fanshi/org-babel-edit-lsp-prep (lang ext)
  `(defun ,(intern (concat "org-babel-edit-prep:" lang))  (babel-info)
     "prep for `org-edit-special' using lsp for some lang"
     (let* ((tmp-src-file (org-babel-temp-file ,(concat lang "-src-edit-") ,(concat "." ext))))
       (with-temp-file tmp-src-file (insert (cadr babel-info)))
       (setq-local buffer-file-name tmp-src-file)
       (lsp)
       ;; NOTE: when lookup doc using lsp, it use pop-up.
       ;; NOTE: when we kill the popped up look-up, whole edit session gone because it was a pop-up
       ;; NOTE: so change the window to non-pop up, and window it more convenient than pop than code editing too.
       ;; FIXME: use set-popup-rule! ?
       (+popup/raise (selected-window)))
     ))

(defvar fanshi/org-babel-edit-lsp-langs '(("haskell" . "hs") ("typescript" . "ts") ("js" . "js") ("python" . "py") ("rust" . "rs"))
  "alist for langs that will use lsp when `org-edit-special', key is the lang, and value is lang's file extension")

;; NOTE: defun org-babel-edit-prep:lang for each lang in `fanshi/org-babel-edit-lsp-langs'
(mapc (lambda (x) (eval `(fanshi/org-babel-edit-lsp-prep ,(car x) ,(cdr x)))) fanshi/org-babel-edit-lsp-langs)

;; NOTE: in `fanshi/org-babel-edit-lsp-prep', the `org-edit-special' pop-up it promoted, and after `org-edit-src-exit', we got one duplicate pop-up shaped window.
;; NOTE: this advice automatically delete that window for better ux
(advice-add 'org-edit-src-exit :around (lambda (f &rest args)
                                         (if-let* ((babel-info org-src--babel-info)
                                                   (lang (car babel-info))
                                                   (babel-lsp-lang (assoc lang fanshi/org-babel-edit-lsp-langs)))
                                             (progn (apply f args) (evil-window-delete))
                                           (apply f args))))
#+end_src

* Haskell
** Template
#+begin_src emacs-lisp :tangle yes
(after! haskell-mode
  (setq! haskell-auto-insert-module-format-string
         (concat haskell-auto-insert-module-format-string
                 "main :: IO ()\n"
                 "main = do\n"
                 "  putText \"Surprise Motherfucker!\"")))
#+end_src

** Lsp
#+begin_src emacs-lisp :tangle yes
(after! lsp-haskell
  (setq! lsp-haskell-server-path "haskell-language-server")
  (setq! lsp-haskell-floskell-on nil)
  (setq! lsp-haskell-fourmolu-on nil)
  (setq! lsp-haskell-brittany-on nil)
  (setq! lsp-haskell-stylish-haskell-on nil)
  (setq-hook! haskell-mode +format-with-lsp t))
#+end_src

* LSP
** tweak file watchers
*** don't watch nix materializtion and golden files for haskell
#+begin_src emacs-lisp :tangle yes
(after! lsp-mode
  (setq! lsp-file-watch-ignored-directories
         (append lsp-file-watch-ignored-directories '("[/\\\\]materialized\\'"
                                                      ;; NOTE: we don't set up lsp for nix, so probably fine for now
                                                      "[/\\\\]nix\\'"
                                                      "[/\\\\]spec\\'"
                                                      "[/\\\\]golden\\'"
                                                      "[/\\\\]\\.postgres\\'"))))
#+end_src

*** don't watch gitignore :No:
- https://github.com/emacs-lsp/lsp-mode/issues/713#issuecomment-985653873
- edit :: bad for performance, emacs stuck to wait for the command to run, may be make it async? disable for now.
#+begin_src emacs-lisp :tangle no
(after! lsp-mode
  (defun ++git-ignore-p (path)
    (let* (           ; trailing / breaks git check-ignore if path is a symlink:
           (path (directory-file-name path))
           (default-directory (file-name-directory path))
           (relpath (file-name-nondirectory path))
           (cmd (format "git check-ignore '%s'" relpath))
           (status (call-process-shell-command cmd)))
      (eq status 0)))

  (defun ++lsp--path-is-watchable-directory-a
      (fn path dir ignored-directories)
    (and (not (++git-ignore-p (f-join dir path)))
         (funcall fn path dir ignored-directories)))

  (advice-add 'lsp--path-is-watchable-directory
              :around #'++lsp--path-is-watchable-directory-a))
#+end_src

