config.org
* Elfeed
#+begin_src emacs-lisp :tangle yes
(after! elfeed
  (setq! elfeed-feeds
         '(("http://feeds.feedburner.com/incodeblog" blog haskell)
           ("https://noonker.github.io/index.xml" blog tech)
           ("https://mollermara.com/rss.xml" emacs blog stat)
           ("https://notxor.nueva-actitud.org/rss.xml" es blog)
           ("http://pragmaticemacs.com/feed/" blog emacs)
           ("https://blog.thomasheartman.com/rss.xml" blog emacs haskell)
           ("https://medium.com/feed/@mojia" en blog)
           ("https://mac-ra.com/feed/atom/" jp blog)
           ("https://www.parsonsmatt.org/feed.xml" en haskell blog)
           ("https://www.fosskers.ca/jp/rss" jp haskell blog)
           ("https://www.fosskers.ca/en/rss" en haskell blog)
           ("https://lexi-lambda.github.io/feeds/all.atom.xml" en haskell blog)
           ("https://kseo.github.io/atom.xml" en haskell blog)
           ("https://sandymaguire.me/atom.xml" en blog)
           ("https://reasonablypolymorphic.com/atom.xml" en haskell blog)
           ("https://www.youtube.com/feeds/videos.xml?channel_id=UCXf8jlTSP9kp6g4ROCfgvbQ" youtube )
           ;; ("https://dev.to/bradparker" en haskell blog)
           ("https://www.williamyaoh.com/feed.atom" en haskell blog)
           ;; ("https://www.reddit.com/r/haskell/top/.rss?t=week" top haskell reddit)
           ;; ("https://www.reddit.com/r/hongkong/top/.rss?t=week" top hongkong reddit)
           )
         elfeed-search-filter "+unread @1-month-ago"))
#+end_src

* Org
** Simple org configs
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq! org-archive-location "archive/%s_archive"
         org-hide-emphasis-markers t
         ;; https://explog.in/notes/writingsetup.html
         ;; org-adapt-indentation nil
         ;; org-indent-indentation-per-level 1
         org-log-into-drawer t))
#+end_src

** Todo keywords
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq! org-todo-keywords '((sequence "TODO(t!)"
                                       "WAIT(w@)"
                                       "HOLD(h@)"
                                       "SOMEDAY(s)"
                                       "|"
                                       "DONE(d!)"
                                       "KILL(k@)")
                             (sequence "PROJ(p!)"
                                       "|"
                                       "DONE(d!)"
                                       "KILL(k@)")
                             (sequence "[ ](T!)" "[-](S!)" "[?](W@/!)" "|" "[X](D!)")))
  (pushnew! org-todo-keyword-faces
            '("TOREAD" org-todo)
            '("SCAN" +org-todo-active)
            '("READING" +org-todo-active)
            '("INBOX" org-todo)))
#+end_src

** Templates
#+begin_src emacs-lisp :tangle yes
(after! org-capture
  ;; remove unwanted default templates
  (setq! org-capture-templates
         (seq-filter
          (lambda (x)
            (and
             (not (string= "t" (car x)))
             (not (string= "j" (car x)))
             (not (string= "n" (car x)))))
          org-capture-templates))
  ;; add my templates
  (pushnew! org-capture-templates
            ;; TODO set up org protocol
            ;; ("c" "org-protocol-capture" entry (file ,(concat org-directory "inbox.org"))
            ;;  "* TODO [[%:link][%:description]]\n\n %i" :immediate-finish t)
            '("l" "link" entry (file "inbox.org")
              "* INBOX %(org-web-tools--org-link-for-url)\n:PROPERTIES:\n:CREATED: %U\n:END:\n %a" :immediate-finish t)
            ;; TODO set up email
            ;; '("e" "email" entry (file+headline ,(concat org-directory "emails.org") "Emails")
            ;;  "* TODO [#A] Reply: %a :@home:@school:" :immediate-finish t)
            ;; TODO set up meeting cpature
            ;; '("m" "meeting" entry (file "inbox.org")
            ;;  "* MEETING with %^{who}\n:PROPERTIES:\n:CREATED: %U\n:END:\n %i%?\n %U")
            ;; '("c" "clock" entry (function org-journal-find-location)
            ;;  "* %(format-time-string  org-journal-time-format) %^{Title}\n%a"
            ;;  :clock-in t
            ;;  :clock-keep t
            ;;  :immediate-finish t
            ;;  )
            '("cl" "sudden reading with clock" entry (file+olp "projects.org" "fanshi" "Tasks")
              "* READING %(org-web-tools--org-link-for-url)\n %i%?\n"
              :clock-in t :clock-keep t :immediate-finish t)
            '("ct" "sudden task with clock" entry (file+olp "projects.org" "fanshi" "Tasks")
              "* TODO %^{Title}\n %i%?\n"
              :clock-in t :clock-keep t :immediate-finish t)
            '("c" "start clock for")
            '("i" "inbox" entry (file "inbox.org") "* INBOX %^{heading}\n:PROPERTIES:\n:CREATED: %U\n:END:\n %i%?\n %a")))
#+end_src
** Org trigger hook for auto-refile during Todo keywords changes
*** fanshi/org-todo-trigger
#+begin_src emacs-lisp :tangle no
(after! org
  (defun fanshi/org-todo-trigger (change-plist) ""
         (let ((to (plist-get change-plist :to)) (from (plist-get change-plist :from)))
           (when (equal (plist-get change-plist :type) 'todo-state-change)
             (cond
              ((equal from "INBOX")
               (cond ((equal to "TOREAD") (let ((org-refile-targets '(("~/org/read.org" . (:level . 1))))) (org-refile)))
                     ((equal to "TODO") (let ((org-refile-targets '(("~/org/projects.org" . (:level . 2))))) (org-refile)))
                     ((equal to "IDEA") (let ((org-refile-targets '(("~/org/idea.org" . (:level . 1))))) (org-refile)))))
              ((and (equal from "IDEA") (equal to "TODO"))
               (let ((org-refile-targets '(("~/org/projects.org" . (:level . 2))))) (org-refile))))))))
#+end_src

*** fanshi/org-todo-trigger
#+begin_src emacs-lisp :tangle yes
(after! org
  (defun fanshi/org-todo-trigger (change-plist) ""
         (when (equal (plist-get change-plist :type) 'todo-state-change)
           (let ((org-refile-targets
                  (pcase (plist-get change-plist :from)
                    ("INBOX" (pcase (plist-get change-plist :to)
                               ("TOREAD" '(("~/org/read.org" . (:level . 1))))
                               ("TODO" '(("~/org/projects.org" . (:level . 2))))
                               ("IDEA" '(("~/org/idea.org" . (:level . 1))))
                               (x nil)))
                    ("IDEA" (pcase (plist-get change-plist :to)
                              ("TODO" '(("~/org/projects.org" . (:level . 2))))
                              (x nil)))
                    (x nil))))
             (when org-refile-targets (org-refile))))))
#+end_src

#+RESULTS:
: fanshi/org-todo-trigger

*** hook
#+begin_src emacs-lisp :tangle yes
(after! org (setq! org-trigger-hook 'fanshi/org-todo-trigger))
;; org-refile-allow-creating-parent-nodes "confirm"
#+end_src

** Roam
#+begin_src emacs-lisp :tangle yes
(setq! fanshi/org-roam-directory "~/org/roam/")
(after! org-roam (setq! org-roam-directory fanshi/org-roam-directory))
#+end_src

*** Journal
#+begin_src emacs-lisp :tangle no
(after! org-journal
  (setq! org-journal-dir (concat fanshi/org-roam-directory "journal/"))
  (setq! org-journal-enable-agenda-integration t)

  (setq! org-journal-carryover-items nil)

  ;; NOTE no need auto close I think
  ;; close after save hook
  ;; (add-hook! org-journal-mode :append (add-hook! 'after-save-hook :local 'kill-buffer-and-window))

  ;; highlight time string with org-date face
  (font-lock-add-keywords 'org-journal-mode '(("\\(\\*\\)\\(\\*\\) .*\\([0-9]\\{2\\}:[0-9]\\{2\\}\\) \\(.+\\)"
                                               (1 'org-hide t)
                                               (2 'org-level-2 t)
                                               (3 'org-date t)
                                               (4 'org-level-2 t)
                                               )))
  ;; org capture

  ;; helper function
  (defun org-journal-find-location ()
    ;; Open today's journal, but specify a non-nil prefix argument in order to
    ;; inhibit inserting the heading; org-capture will insert the heading.
    (org-journal-new-entry t)
    ;; Position point on the journal's top-level heading so that org-capture
    ;; will add the new entry as a child entry.
    (goto-char (point-min))))
#+end_src

*** Bibitex
#+begin_src emacs-lisp :tangle no
(use-package! org-roam-bibtex
  :after (org-roam)
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
  (setq orb-preformat-keywords
        '("=key=" "title" "url" "file" "author-or-editor" "keywords"))
  (setq orb-templates
        `(("r" "ref" plain (function org-roam-capture--get-point)
           ""
           :file-name "lit/${slug}"
           :head ,(concat
                   "#+setupfile: ./hugo_setup.org\n"
                   "#+title: ${=key=}: ${title}\n"
                   "#+roam_key: ${ref}\n\n"
                   "* ${title}\n"
                   "  :PROPERTIES:\n"
                   "  :Custom_ID: ${=key=}\n"
                   "  :URL: ${url}\n"
                   "  :AUTHOR: ${author-or-editor}\n"
                   "  :NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
                   "  :NOTER_PAGE: \n"
                   "  :END:\n")
           :unnarrowed t))))
#+end_src

