config.el
  (setq! elfeed-feeds
         '(("http://feeds.feedburner.com/incodeblog" blog haskell)
           ("https://noonker.github.io/index.xml" blog tech)
           ("https://mollermara.com/rss.xml" emacs blog stat)
           ("https://notxor.nueva-actitud.org/rss.xml" es blog)
           ("http://pragmaticemacs.com/feed/" blog emacs)
           ("https://blog.thomasheartman.com/rss.xml" blog emacs haskell)
           ("https://medium.com/feed/@mojia" en blog)
           ("https://mac-ra.com/feed/atom/" jp blog)
           ("https://www.parsonsmatt.org/feed.xml" en haskell blog)
           ("https://www.fosskers.ca/jp/rss" jp haskell blog)
           ("https://www.fosskers.ca/en/rss" en haskell blog)
           ("https://lexi-lambda.github.io/feeds/all.atom.xml" en haskell blog)
           ("https://kseo.github.io/atom.xml" en haskell blog)
           ("https://sandymaguire.me/atom.xml" en blog)
           ("https://reasonablypolymorphic.com/atom.xml" en haskell blog)
           ("https://www.youtube.com/feeds/videos.xml?channel_id=UCXf8jlTSP9kp6g4ROCfgvbQ" youtube )
           ;; ("https://dev.to/bradparker" en haskell blog)
           ("https://www.williamyaoh.com/feed.atom" en haskell blog)
           ;; ("https://www.reddit.com/r/haskell/top/.rss?t=week" top haskell reddit)
           ;; ("https://www.reddit.com/r/hongkong/top/.rss?t=week" top hongkong reddit)
           )
         elfeed-search-filter "+unread @1-month-ago"))

(after! org
  (setq! org-archive-location "archive/%s_archive"
         org-hide-emphasis-markers t
         ;; https://explog.in/notes/writingsetup.html
         ;; org-adapt-indentation nil
         ;; org-indent-indentation-per-level 1
         org-log-into-drawer t))

(after! org
  (setq! org-todo-keywords '((sequence "TODO(t!)"
                                       "WAIT(w@)"
                                       "HOLD(h@)"
                                       "SOMEDAY(s)"
                                       "|"
                                       "DONE(d!)"
                                       "KILL(k@)")
                             (sequence "PROJ(p!)"
                                       "|"
                                       "DONE(d!)"
                                       "KILL(k@)")
                             (sequence "[ ](T!)" "[-](S!)" "[?](W@/!)" "|" "[X](D!)")))
  (pushnew! org-todo-keyword-faces
            '("TOREAD" org-todo)
            '("SCAN" +org-todo-active)
            '("READING" +org-todo-active)
            '("INBOX" org-todo)))

(after! org-capture
  ;; remove unwanted default templates
  (setq! org-capture-templates
         (seq-filter
          (lambda (x)
            (and
             (not (string= "t" (car x)))
             (not (string= "j" (car x)))
             (not (string= "n" (car x)))))
          org-capture-templates))
  ;; add my templates
  (pushnew! org-capture-templates
            ;; TODO set up org protocol
            ;; ("c" "org-protocol-capture" entry (file ,(concat org-directory "inbox.org"))
            ;;  "* TODO [[%:link][%:description]]\n\n %i" :immediate-finish t)
            '("l" "link" entry (file "inbox.org")
              "* INBOX %(org-web-tools--org-link-for-url)\n:PROPERTIES:\n:CREATED: %U\n:END:\n %a" :immediate-finish t)
            ;; TODO set up email
            ;; '("e" "email" entry (file+headline ,(concat org-directory "emails.org") "Emails")
            ;;  "* TODO [#A] Reply: %a :@home:@school:" :immediate-finish t)
            ;; TODO set up meeting cpature
            ;; '("m" "meeting" entry (file "inbox.org")
            ;;  "* MEETING with %^{who}\n:PROPERTIES:\n:CREATED: %U\n:END:\n %i%?\n %U")
            ;; '("c" "clock" entry (function org-journal-find-location)
            ;;  "* %(format-time-string  org-journal-time-format) %^{Title}\n%a"
            ;;  :clock-in t
            ;;  :clock-keep t
            ;;  :immediate-finish t
            ;;  )
            '("cl" "sudden reading with clock" entry (file+olp "projects.org" "fanshi" "Tasks")
              "* READING %(org-web-tools--org-link-for-url)\n %i%?\n"
              :clock-in t :clock-keep t :immediate-finish t)
            '("ct" "sudden task with clock" entry (file+olp "projects.org" "fanshi" "Tasks")
              "* TODO %^{Title}\n %i%?\n"
              :clock-in t :clock-keep t :immediate-finish t)
            '("c" "start clock for")
            '("i" "inbox" entry (file "inbox.org") "* INBOX %^{heading}\n:PROPERTIES:\n:CREATED: %U\n:END:\n %i%?\n %a")))

(after! org
  (defun fanshi/org-todo-trigger (change-plist) ""
         (when (equal (plist-get change-plist :type) 'todo-state-change)
           (let ((org-refile-targets
                  (pcase (plist-get change-plist :from)
                    ("INBOX" (pcase (plist-get change-plist :to)
                               ("TOREAD" '(("~/org/read.org" . (:level . 1))))
                               ("TODO" '(("~/org/projects.org" . (:level . 2))))
                               ("IDEA" '(("~/org/idea.org" . (:level . 1))))
                               (x nil)))
                    ("IDEA" (pcase (plist-get change-plist :to)
                              ("TODO" '(("~/org/projects.org" . (:level . 2))))
                              (x nil)))
                    (x nil))))
             (when org-refile-targets (org-refile))))))

(after! org (setq! org-trigger-hook 'fanshi/org-todo-trigger))
;; org-refile-allow-creating-parent-nodes "confirm"

(setq! fanshi/org-roam-directory "~/org/roam/")
(after! org-roam (setq! org-roam-directory fanshi/org-roam-directory))
