config.el

;; (use-package! bibtex-completion
;;   :defer t
;;   :config
;;   (setq bibtex-completion-notes-path (concat fanshi/org-roam-directory "notes/")
;;         ;; bibtex-completion-bibliography "~/.org/braindump/org/biblio.bib"
;;         bibtex-completion-pdf-field "file"
;;         bibtex-completion-notes-template-multiple-files
;;         (concat
;;          "#+title: ${title}\n"
;;          "#+roam_key: cite:${=key=}\n"
;;          "* TODO Notes\n"
;;          ":PROPERTIES:\n"
;;          ":Custom_ID: ${=key=}\n"
;;          ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
;;          ":AUTHOR: ${author-abbrev}\n"
;;          ":JOURNAL: ${journaltitle}\n"
;;          ":DATE: ${date}\n"
;;          ":YEAR: ${year}\n"
;;          ":DOI: ${doi}\n"
;;          ":URL: ${url}\n"
;;          ":END:\n\n"
;;          )))

;; (use-package! citeproc-org
;;   :after org
;;   :config
;;   (citeproc-org-setup))

(defun fanshi/make-line () "" (concat "\n" (make-string (window-width) 9472)))

(after! org-agenda
  ;;  for clock
  (setq!
   ;; org-agenda-start-with-clockreport-mode t
   ;; org-agenda-files (seq-filter (lambda (x) (not (string-match-p "\\.#.*\\.org$" x)))
   ;;                              (append (directory-files (concat fanshi/org-roam-directory "notes/") 'FUll "\\.org$")
   ;;                                      (directory-files org-directory 'FULL "\\.org$")
   ;;                                      ))
   org-clock-report-include-clocking-task t
   org-agenda-clockreport-parameter-plist (quote (:link t :maxlevel 4 :fileskip0 t :compact t :narrow 80))
   )
  (setq! org-agenda-block-separator 9472
         org-agenda-compact-blocks t
         org-agenda-breadcrumbs-separator " / "
         org-agenda-span 'day
         org-agenda-start-day nil
         org-agenda-start-on-weekday nil
         org-agenda-current-time-string "⬲ NOW -- NOW --"
         org-agenda-prefix-format '(;; (agenda . " %-3i %18s  %?-12t %-25b ")
                                    ;; (agenda . " %-3i %-44b %?18s %?-12t")
                                    ;; (agenda . " %-3i %-44b %?-18s %?-12t")
                                    (agenda . " %-3i %-44b %11s %?-12t")
                                    (todo . " %-3i                     ")
                                    (tags . " %i %-12:c")
                                    (search . " %i %-12:c"))
         org-agenda-format-date (lambda (date) (concat (fanshi/make-line) "\n" (org-agenda-format-date-aligned date)))))

(setq! fanshi/agenda
       '((:name "Clocked Today 📰📰📰" :log t)
         (:name "Calendar 📅📅📅" :time-grid t :and (:scheduled today :not (:habit t) ))
         ;; (:name "Calendar 📅📅📅" :time-grid t :scheduled today)
         (:name "Deadlines Just Aren't Real To Me Until I'm Staring One In The Face 🚨🚨🚨" :deadline today :order 2)
         (:name "What Is Dead May Never Die 🚣🚣🚣" :deadline past :order 3)
         (:name "Defuse The Bomb 💣💣💣" :deadline future :order 4)
         (:name "Déjà Vu 🔁🔁🔁" :and (:habit t :not (:scheduled future)) :order 5) ;; 🧟🧟🧟
         ;; (:name "Meetings"
         ;;  :and (:todo "MEETING" :scheduled future)
         ;;  :order 8)
         ))

(setq! fanshi/alltodo
       '((:discard (:scheduled today :deadline t))
         (:name "Important 💎💎💎" :tag "Payment" :priority "A" :order 2) ;;🚔🚔🚔
         (:name "Inbox 📬📬📬" :todo "INBOX" :order 3)
         (:discard (:habit t))
         (:name "Peek Into Future 🔮🔮🔮" :scheduled future :order 4)
         (:name "Watching 📺📺📺" :and (:todo "READING" :tag "TV") :order 6)
         (:name "Reading 📚📚📚" :todo "READING" :order 7)
         (:name "Quick Picks 🚀🚀🚀" :and (:effort< "0:30" :todo "TODO") :order 8)
         (:name "Others 🏝🏝🏝" :and (:priority "B" :not (:file-path "projects")) :order 20)
         ;; (:name "Optional 🧧🧧🧧" :and (:priority "C" :not (:file-path "projects")) :order 90)
         ;; (:name "waht 🧧🧧🧧" :todo "TOREAD" :order 90)
         ;; NOTE: check
         ;; (:name "Should Be Nothing"
         ;;  :not (:file-path "projects"
         ;;        :file-path "read"
         ;;        :file-path "idea")
         ;;  :order 99)
         (:name "Camping 🏕🏕🏕" :todo "WAIT" :order 9) ; Set order of this section 💎💎💎
         ;; NOTE Project
         (:discard (:not (:file-path "projects")))
         (:auto-outline-path t :order 5)))
