config.org
**** setup
#+begin_src emacs-lisp :tangle yes
(setq! fanshi/private-alltodo (cons '(:discard (:tag "AgnesNg")) fanshi/alltodo)
       fanshi/private-agenda (cons '(:discard (:tag "AgnesNg")) fanshi/agenda)
       fanshi/public-alltodo (cons '(:discard (:tag "Private")) fanshi/private-alltodo)
       fanshi/public-agenda (cons '(:discard (:tag "Private")) fanshi/private-agenda)
       agnes/alltodo (cons '(:discard (:not (:tag "AgnesNg"))) fanshi/alltodo)
       agnes/agenda (cons '(:discard (:not (:tag "AgnesNg"))) fanshi/agenda))
(use-package! org-super-agenda
  :after org-agenda
  ;; :defer-incrementally org-roam org-journal
  :init
  (setq org-agenda-show-log t
        ;; NOTE: https://github.com/alphapapa/org-super-agenda/issues/50
        org-super-agenda-header-map (make-sparse-keymap)
        ;; fanshi/org-agenda-header (concat "\n" (make-string (window-width) 9472))
        ;; fanshi/make-org-agenda-header (defun () (concat "\n" (make-string (window-width) 9472)))
        org-agenda-custom-commands '(("a" . "Agenda")
                                     ("aa" "My Agenda"
                                      ((agenda "" ((org-super-agenda-groups fanshi/public-agenda)))
                                       (alltodo "" ((org-agenda-overriding-header (fanshi/make-line))
                                                    (org-super-agenda-groups fanshi/public-alltodo)))))
                                     ("ag" "Agnes's Agenda"
                                      ((agenda "" ((org-super-agenda-groups agnes/agenda)))
                                       (alltodo "" ((org-agenda-overriding-header (fanshi/make-line))
                                                    (org-super-agenda-groups agnes/alltodo)))))
                                     ("p" . "Private")
                                     ("pa" "Agenda" ((agenda "" ((org-super-agenda-groups fanshi/private-agenda)))
                                                     (alltodo "" ((org-agenda-overriding-header (fanshi/make-line))
                                                                  (org-super-agenda-groups fanshi/private-alltodo)))))))
  :config
  (org-super-agenda-mode))
#+end_src

#+RESULTS:
: t

** Web tool
#+begin_src emacs-lisp :tangle yes
(use-package! org-web-tools
  ;; :after-call org-capture
  :commands (org-web-tools--org-link-for-url))
#+end_src

* Langtool
#+begin_src emacs-lisp :tangle yes
(after! langtool (setq! langtool-bin "languagetool-commandline"))
#+end_src

* Plantuml
- set up plantuml-mode
#+begin_src emacs-lisp :tangle yes
(after! plantuml-mode (setq! plantuml-default-exec-mode 'executable))
#+end_src

* hl-todo
#+begin_src emacs-lisp :tangle yes
;; TEMP keywords
(after! hl-todo (pushnew! hl-todo-keyword-faces '("TEMP" 'warning 'bold)))
#+end_src

* Dired
** Narrow
#+begin_src emacs-lisp :tangle yes
(use-package! dired-narrow
  :commands (dired-narrow-fuzzy)
  :init
  (map! :map dired-mode-map :n "/" #'dired-narrow-fuzzy))
#+end_src

** Bug temp fix
- why :: ls does not support --dired; see ‘dired-use-ls-dired’ for more details.
- ref :: https://stackoverflow.com/questions/25125200/emacs-error-ls-does-not-support-dired
#+begin_src emacs-lisp :tangle yes
(after! dired (setq dired-use-ls-dired nil))
#+end_src

* Python
** Lpy
#+begin_src emacs-lisp :tangle yes
(use-package! lpy
  :hook (python-mode . lpy-mode)
  :init (setq lispy-override-python-binary "python"))
#+end_src

* Lisp
** Lispy
#+begin_src emacs-lisp :tangle yes
(use-package! lispy
  :init (setq lispy-compat '(edebug cider)))
#+end_src

* Gif screencast
#+begin_src emacs-lisp :tangle yes
(use-package! gif-screencast
  :commands (gif-screencast-start-or-stop)
  :init (setq gif-screencast-args '("-x")
              gif-screencast-capture-format "ppm"
              gif-screencast-cropping-program "" ;; NOTE diable cropping, seems its only crop part of the emacs screen fro some reason
              )
  :bind ("<f12>" . gif-screencast-start-or-stop))
#+end_src

* Nov mode
#+begin_src emacs-lisp :tangle yes
(use-package! nov :mode ("\\.\\(epub\\|mobi\\)\\'" . nov-mode))
#+end_src

* Music Player
#+begin_src emacs-lisp :tangle yes
;; (use-package! vuiet :defer)
#+end_src

* Keycast
#+begin_src emacs-lisp :tangle yes
(use-package! keycast
  :defer
  :config (define-minor-mode keycast-mode
            "Show current command and its key binding in the mode line."
            :global t
            (if keycast-mode
                (add-hook 'pre-command-hook 'keycast-mode-line-update t) (remove-hook 'pre-command-hook 'keycast-mode-line-update)))
  (add-to-list 'global-mode-string '("" mode-line-keycast))
  )
#+end_src

* Calendar
#+begin_src emacs-lisp :tangle yes
;; (use-package! calfw)
#+end_src

* Pdf-view
#+begin_src emacs-lisp :tangle yes
(after! pdf-view
  (setq! pdf-tools-installer-os "nixos")
  (pdf-tools-install)
  (setq! pdf-view-midnight-colors '("#ABB2BF" . "#282C35"))
  (add-hook! pdf-tools-enabled #'pdf-view-midnight-minor-mode)
  ;; (add-hook! pdf-tools-enabled #'hide-mode-line-mode)
  )
#+end_src

* Jest
#+begin_src emacs-lisp :tangle yes
(use-package! jest :hook (js2-mode . jest-minor-mode))
#+end_src

* Scala
#+begin_src emacs-lisp :tangle yes
(push '("\\.sc\\'" . scala-mode) auto-mode-alist)
(use-package! sbt-mode :disabled)
#+end_src

** ammonite-term-repl
#+begin_src emacs-lisp :tangle yes
(use-package! ammonite-term-repl
  :after scala-mode
  :config (progn
            (setq ammonite-term-repl-auto-config-mill-project nil)
            (setq ammonite-term-repl-auto-detect-predef-file nil)
            ;; (setq ammonite-term-repl-program-args '("-s" "--no-default-predef"))
            (set-repl-handler! 'scala-mode #'run-ammonite :persist t)))
#+end_src
* no dashboard banner
#+begin_src elisp :tangle yes
(defun fanshi/doom-dashboard-draw-ascii-banner-fn ())
(setq! +doom-dashboard-ascii-banner-fn #'fanshi/doom-dashboard-draw-ascii-banner-fn)
#+end_src

* pass config
#+begin_src elisp :tangle yes
(after! pass (setq! pass-show-keybindings nil))
#+end_src

* email
#+BEGIN_SRC elisp :tangle yes
(after! notmuch (setq! +notmuch-sync-backend 'mbsync))
;; (setq +notmuch-sync-backend 'mbsync-xdg)
#+END_SRC

#+BEGIN_SRC elisp :tangle yes
(after! sendmail (setq! sendmail-program (executable-find "msmtp")))
#+END_SRC

* Custom
#+begin_src emacs-lisp :tangle yes
;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+end_src
