config.el

(setq! fanshi/private-alltodo (cons '(:discard (:tag "AgnesNg")) fanshi/alltodo)
       fanshi/private-agenda (cons '(:discard (:tag "AgnesNg")) fanshi/agenda)
       fanshi/public-alltodo (cons '(:discard (:tag "Private")) fanshi/private-alltodo)
       fanshi/public-agenda (cons '(:discard (:tag "Private")) fanshi/private-agenda)
       agnes/alltodo (cons '(:discard (:not (:tag "AgnesNg"))) fanshi/alltodo)
       agnes/agenda (cons '(:discard (:not (:tag "AgnesNg"))) fanshi/agenda))
(use-package! org-super-agenda
  :after org-agenda
  ;; :defer-incrementally org-roam org-journal
  :init
  (setq org-agenda-show-log t
        ;; NOTE: https://github.com/alphapapa/org-super-agenda/issues/50
        org-super-agenda-header-map (make-sparse-keymap)
        ;; fanshi/org-agenda-header (concat "\n" (make-string (window-width) 9472))
        ;; fanshi/make-org-agenda-header (defun () (concat "\n" (make-string (window-width) 9472)))
        org-agenda-custom-commands '(("a" . "Agenda")
                                     ("aa" "My Agenda"
                                      ((agenda "" ((org-super-agenda-groups fanshi/public-agenda)))
                                       (alltodo "" ((org-agenda-overriding-header (fanshi/make-line))
                                                    (org-super-agenda-groups fanshi/public-alltodo)))))
                                     ("ag" "Agnes's Agenda"
                                      ((agenda "" ((org-super-agenda-groups agnes/agenda)))
                                       (alltodo "" ((org-agenda-overriding-header (fanshi/make-line))
                                                    (org-super-agenda-groups agnes/alltodo)))))
                                     ("p" . "Private")
                                     ("pa" "Agenda" ((agenda "" ((org-super-agenda-groups fanshi/private-agenda)))
                                                     (alltodo "" ((org-agenda-overriding-header (fanshi/make-line))
                                                                  (org-super-agenda-groups fanshi/private-alltodo)))))))
  :config
  (org-super-agenda-mode))

(use-package! org-web-tools
  ;; :after-call org-capture
  :commands (org-web-tools--org-link-for-url))

(after! langtool (setq! langtool-bin "languagetool-commandline"))

(after! plantuml-mode (setq! plantuml-default-exec-mode 'executable))

;; TEMP keywords
(after! hl-todo (pushnew! hl-todo-keyword-faces '("TEMP" 'warning 'bold)))

(use-package! dired-narrow
  :commands (dired-narrow-fuzzy)
  :init
  (map! :map dired-mode-map :n "/" #'dired-narrow-fuzzy))

(after! dired (setq dired-use-ls-dired nil))

(use-package! lpy
  :hook (python-mode . lpy-mode)
  :init (setq lispy-override-python-binary "python"))

(use-package! lispy
  :init (setq lispy-compat '(edebug cider)))

(use-package! gif-screencast
  :commands (gif-screencast-start-or-stop)
  :init (setq gif-screencast-args '("-x")
              gif-screencast-capture-format "ppm"
              gif-screencast-cropping-program "" ;; NOTE diable cropping, seems its only crop part of the emacs screen fro some reason
              )
  :bind ("<f12>" . gif-screencast-start-or-stop))

(use-package! nov :mode ("\\.\\(epub\\|mobi\\)\\'" . nov-mode))

;; (use-package! vuiet :defer)

(use-package! keycast
  :defer
  :config (define-minor-mode keycast-mode
            "Show current command and its key binding in the mode line."
            :global t
            (if keycast-mode
                (add-hook 'pre-command-hook 'keycast-mode-line-update t) (remove-hook 'pre-command-hook 'keycast-mode-line-update)))
  (add-to-list 'global-mode-string '("" mode-line-keycast))
  )

;; (use-package! calfw)

(after! pdf-view
  (setq! pdf-tools-installer-os "nixos")
  (pdf-tools-install)
  (setq! pdf-view-midnight-colors '("#ABB2BF" . "#282C35"))
  (add-hook! pdf-tools-enabled #'pdf-view-midnight-minor-mode)
  ;; (add-hook! pdf-tools-enabled #'hide-mode-line-mode)
  )

(use-package! jest :hook (js2-mode . jest-minor-mode))

(push '("\\.sc\\'" . scala-mode) auto-mode-alist)
(use-package! sbt-mode :disabled)

(use-package! ammonite-term-repl
  :after scala-mode
  :config (progn
            (setq ammonite-term-repl-auto-config-mill-project nil)
            (setq ammonite-term-repl-auto-detect-predef-file nil)
            ;; (setq ammonite-term-repl-program-args '("-s" "--no-default-predef"))
            (set-repl-handler! 'scala-mode #'run-ammonite :persist t)))

(defun fanshi/doom-dashboard-draw-ascii-banner-fn ())
(setq! +doom-dashboard-ascii-banner-fn #'fanshi/doom-dashboard-draw-ascii-banner-fn)

(after! pass (setq! pass-show-keybindings nil))

(after! notmuch (setq! +notmuch-sync-backend 'mbsync))
;; (setq +notmuch-sync-backend 'mbsync-xdg)

(after! sendmail (setq! sendmail-program (executable-find "msmtp")))

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
